//
// Package: HomeKit-ADK
// Version: 2.0 (16A62)
//
// Disclaimer: IMPORTANT: This Apple software is supplied to you, by Apple Inc. ("Apple"), in your
// capacity as a current, and in good standing, Licensee in the MFi Licensing Program. Use of this
// Apple software is governed by and subject to the terms and conditions of your MFi License,
// including, but not limited to, the restrictions specified in the provision entitled "Public
// Software", and is further subject to your agreement to the following additional terms, and your
// agreement that the use, installation, modification or redistribution of this Apple software
// constitutes acceptance of these additional terms. If you do not agree with these additional terms,
// you may not use, install, modify or redistribute this Apple software.
//
// Subject to all of these terms and in consideration of your agreement to abide by them, Apple grants
// you, for as long as you are a current and in good-standing MFi Licensee, a personal, non-exclusive
// license, under Apple's copyrights in this Apple software (the "Apple Software"), to use,
// reproduce, and modify the Apple Software in source form, and to use, reproduce, modify, and
// redistribute the Apple Software, with or without modifications, in binary form, in each of the
// foregoing cases to the extent necessary to develop and/or manufacture "Proposed Products" and
// "Licensed Products" in accordance with the terms of your MFi License. While you may not

#ifdef __cplusplus
extern "C" {
#endif

// C library header files that are also available in freestanding environments (-ffreestanding).
#include <float.h>
#include <iso646.h>
#include <limits.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "HAPBase+CompilerAbstraction.h"

#if __has_feature(nullability)
#pragma clang assume_nonnull begin
#endif

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Gets the number of elements in an array.
 *
 * - This only works before the array is passed to other C functions!
 *
 * @param      array                Array.
 *
 * @return Number of elements in the array.
 */
#define HAPArrayCount(array) ((size_t) (sizeof (array) / sizeof ((array)[0])))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Returns the lesser of two comparable values.
 *
 * @param      x                    A value to compare.
 * @param      y                    Another value to compare.
 *
 * @return The lesser of @p x and @p y. If @p x is equal to @p y, returns @p x.
 */
#define HAPMin(x, y) (((x) <= (y)) ? (x) : (y))

/**
 * Returns the greater of two comparable values.
 *
 * @param      x                    A value to compare.
 * @param      y                    Another value to compare.
 *
 * @return The greater of @p x and @p y. If @p x is equal to @p y, returns @p y.
 */
#define HAPMax(x, y) (((x) <= (y)) ? (y) : (x))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Error type.
 */
HAP_ENUM_BEGIN(uint8_t, HAPError) {
    kHAPError_None,                 /**< No error occurred. */
    kHAPError_Unknown,              /**< Unknown error. */
    kHAPError_InvalidState,         /**< Operation is not supported in current state. */
    kHAPError_InvalidData,          /**< Data has unexpected format. */
    kHAPError_OutOfResources,       /**< Out of resources. */
    kHAPError_NotAuthorized,        /**< Insufficient authorization. */
    kHAPError_Busy                  /**< Operation failed temporarily, retry later. */
} HAP_ENUM_END(uint8_t, HAPError);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * System time expressed as milliseconds relative to an implementation-defined time in the past.
 */
typedef uint64_t HAPTime;

/**
 * Time interval in nanoseconds.
 */
typedef uint64_t HAPTimeNS;

/**
 * 1 millisecond in milliseconds.
 */
#define HAPMillisecond ((HAPTime) 1)

/**
 * 1 second in milliseconds.
 */
#define HAPSecond ((HAPTime) (1000 * HAPMillisecond))

/**
 * 1 minute in milliseconds.
 */
#define HAPMinute ((HAPTime) (60 * HAPSecond))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Setup info.
 */
typedef struct {
    uint8_t salt[16];               /**< SRP salt. */
    uint8_t verifier[384];          /**< SRP verifier. */
} HAPSetupInfo;
HAP_STATIC_ASSERT(sizeof (HAPSetupInfo) == 400, HAPSetupInfo);

/**
 * NULL-terminated setup ID string (format: XXXX).
 */
typedef struct {
    char stringValue[4 + 1];        /**< NULL-terminated. */
} HAPSetupID;
HAP_STATIC_ASSERT(sizeof (HAPSetupID) == 5, HAPSetupID);

/**
 * NULL-terminated setup code string (format: XXX-XX-XXX).
 */
typedef struct {
    char stringValue[10 + 1];       /**< NULL-terminated. */
} HAPSetupCode;
HAP_STATIC_ASSERT(sizeof (HAPSetupCode) == 11, HAPSetupCode);

/**
 * NULL-terminated setup payload string.
 */
typedef struct {
    char stringValue[20 + 1];       /**< NULL-terminated. */
} HAPSetupPayload;
HAP_STATIC_ASSERT(sizeof (HAPSetupPayload) == 21, HAPSetupPayload);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Advertising interval for Bluetooth LE.
 *
 * Unit: 0.625 ms
 *
 * @see Bluetooth Core Specification Version 5
 *      Vol 2 Part E Section 7.8.5 LE Set Advertising Parameters Command
 */
typedef uint16_t HAPBLEAdvertisingInterval;

/**
 * Converts an advertising interval in milliseconds to an advertising interval for Bluetooth LE.
 *
 * @param      milliseconds         Advertising interval in milliseconds.
 *
 * @return Advertising interval for Bluetooth LE.
 */
#define HAPBLEAdvertisingIntervalCreateFromMilliseconds(milliseconds) \
    ((HAPBLEAdvertisingInterval) ((milliseconds) / (0.625f)))

/**
 * Converts an advertising interval for Bluetooth LE to an advertising interval in milliseconds.
 *
 * @param      advertisingInterval  Advertising interval for Bluetooth LE.
 *
 * @return Advertising interval in milliseconds.
 */
#define HAPBLEAdvertisingIntervalGetMilliseconds(advertisingInterval) \
    ((advertisingInterval) * (0.625f * HAPMillisecond))

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Video codec type.
 */
HAP_ENUM_BEGIN(uint8_t, HAPVideoCodecType) {
    /**
     * H.264.
     */
    kHAPVideoCodecType_H264
} HAP_ENUM_END(uint8_t, HAPVideoCodecType);

typedef void HAPVideoCodecParameters;

// <editor-fold desc="HAPH264VideoCodec">

/**
 * Type of H.264 Profile.
 */
HAP_ENUM_BEGIN(uint8_t, HAPH264VideoCodecProfile) {
    /**
     * Constrained Baseline Profile.
     */
    kHAPH264VideoCodecProfile_ConstrainedBaseline = 1 << 0,

    /**
     * Main Profile.
     */
    kHAPH264VideoCodecProfile_Main = 1 << 1,

    /**
     * High Profile.
     */
    kHAPH264VideoCodecProfile_High = 1 << 2
} HAP_ENUM_END(uint8_t, HAPH264VideoCodecProfile);

/**
 * H.264 Profile support level.
 */
HAP_ENUM_BEGIN(uint8_t, HAPH264VideoCodecProfileLevel) {
    /**
     * 3.1.
     */
    kHAPH264VideoCodecProfileLevel_3_1 = 1 << 0,

    /**
     * 3.2.
     */
    kHAPH264VideoCodecProfileLevel_3_2 = 1 << 1,

    /**
     * 4.
     */
    kHAPH264VideoCodecProfileLevel_4 = 1 << 2
} HAP_ENUM_END(uint8_t, HAPH264VideoCodecProfileLevel);

/**
 * H.264 packetization mode.
 */
HAP_ENUM_BEGIN(uint8_t, HAPH264VideoCodecPacketizationMode) {
    /**
     * Non-interleaved mode.
     */
    kHAPH264VideoCodecPacketizationMode_NonInterleaved = 1 << 0
} HAP_ENUM_END(uint8_t, HAPH264VideoCodecPacketizationMode);

/**
 * H.264 parameters.
 */
typedef struct {
    /**
     * Type(s) of H.264 Profile.
     */
    HAPH264VideoCodecProfile profile;

    /**
     * Profile support level.
     */
    HAPH264VideoCodecProfileLevel level;

    /**
     * Packetization mode(s).
     */
    HAPH264VideoCodecPacketizationMode packetizationMode;

    /**
     * CVO supported / enabled.
     */
    bool cvo;

    /**
     * ID for CVO RTP extension.
     */
    uint8_t cvoID;
} HAPH264VideoCodecParameters;

// </editor-fold>

/**
 * Video attributes.
 */
typedef struct {
    uint16_t width;                 /**< Image width in pixels. */
    uint16_t height;                /**< Image height in pixels. */
    uint8_t maxFrameRate;           /**< Maximum frame rate. */
} HAPVideoAttributes;

/**
 * Audio codec type.
 */
HAP_ENUM_BEGIN(uint8_t, HAPAudioCodecType) {
    /**
     * PCMU.
     */
    kHAPAudioCodecType_PCMU = 1,

    /**
     * PCMA.
     */
    kHAPAudioCodecType_PCMA,

    /**
     * AAC-ELD.
     */
    kHAPAudioCodecType_AAC_ELD,

    /**
     * Opus.
     */
    kHAPAudioCodecType_Opus,

    /**
     * MSBC.
     */
    kHAPAudioCodecType_MSBC,

    /**
     * AMR.
     */
    kHAPAudioCodecType_AMR,

    /**
     * AMR-WB.
     */
    kHAPAudioCodecType_AMR_WB
} HAP_ENUM_END(uint8_t, HAPAudioCodecType);

/**
 * Audio codec bit rate control mode.
 */
HAP_ENUM_BEGIN(uint8_t, HAPAudioCodecBitRateControlMode) {
    /**
     * Variable bit-rate.
     */
    kHAPAudioCodecBitRateControlMode_Variable = 1 << 0,

    /**
     * Constant bit-rate.
     */
    kHAPAudioCodecBitRateControlMode_Constant = 1 << 1
} HAP_ENUM_END(uint8_t, HAPAudioCodecBitRateControlMode);

/**
 * Audio codec sample rate.
 */
HAP_ENUM_BEGIN(uint8_t, HAPAudioCodecSampleRate) {
    /**
     * 8 KHz.
     */
    kHAPAudioCodecSampleRate_8KHz = 1 << 0,

    /**
     * 16 KHz.
     */
    kHAPAudioCodecSampleRate_16KHz = 1 << 1,

    /**
     * 24 KHz.
     */
    kHAPAudioCodecSampleRate_24KHz = 1 << 2
} HAP_ENUM_END(uint8_t, HAPAudioCodecSampleRate);

/**
 * Audio codec parameters.
 */
typedef struct {
    /**
     * Audio codec type.
     */
    HAPAudioCodecType type;

    /**
     * Number of audio channels.
     */
    uint8_t numberOfChannels;

    /**
     * Bit-rate.
     */
    HAPAudioCodecBitRateControlMode bitRateMode;

    /**
     * Sample rate.
     */
    HAPAudioCodecSampleRate sampleRate;
} HAPAudioCodecParameters;

/**
 * SRTP crypto suite.
 */
HAP_ENUM_BEGIN(uint8_t, HAPSRTPCryptoSuite) {
    /**
     * AES_CM_128_HMAC_SHA1_80.
     */
    kHAPSRTPCryptoSuite_AES_CM_128_HMAC_SHA1_80 = 1 << 0,

    /**
     * AES_256_CM_HMAC_SHA1_80.
     */
    kHAPSRTPCryptoSuite_AES_256_CM_HMAC_SHA1_80 = 1 << 1,

    /**
     * Disabled.
     *
     * - This crypto suite is not supported on certain non-internal non-developer versions of iOS.
     *   If required, consider trying to test on a pre-release iOS Beta version.
     */
    kHAPSRTPCryptoSuite_Disabled = 1 << 2
} HAP_ENUM_END(uint8_t, HAPSRTPCryptoSuite);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/**
 * Fills a buffer with zeroes.
 *
 * @param[out] bytes                Buffer to fill with zeroes.
 * @param      numBytes             Number of bytes to fill.
 */
void HAPRawBufferZero(
    void *bytes,
    size_t numBytes);

/**
 * Copies bytes from a source buffer to a destination buffer.
 *
 * @param[out] destinationBytes     Destination buffer.
 * @param      sourceBytes          Source buffer.
 * @param      numBytes             Number of bytes to copy.
 */
void HAPRawBufferCopyBytes(
    void *destinationBytes,
    const void *sourceBytes,
    size_t numBytes);

/**
 * Determines equality of two buffers in constant time.
 *
 * @param      bytes                Buffer to compare.
 * @param      otherBytes           Buffer to compare with.
 * @param      numBytes             Number of bytes to compare.
 *
 * @return true                     If the contents of both buffers are equal.
 * @return false                    Otherwise.
 */
HAP_RESULT_USE_CHECK
bool HAPRawBufferAreEqual(
    const void *bytes,
    const void *otherBytes,
    size_t numBytes);

/**
 * Determines if a buffer contains only zeroes in constant time.
 *
 * @param      bytes                Buffer to check for zeroes.
 * @param      numBytes             Length of buffer.
 *
 * @return true                     If the contents of both buffers are equal.
 * @return false                    Otherwise.
 */
HAP_RESULT_USE_CHECK
bool HAPRawBufferIsZero(
    const void *bytes,
    size_t numBytes);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

HAP_STATIC_ASSERT(CHAR_BIT == 8, CHAR_BIT);
HAP_STATIC_ASSERT(sizeof (bool) == 1, bool);
HAP_STATIC_ASSERT(sizeof (uint8_t) == 1, uint8_t);
HAP_STATIC_ASSERT(sizeof (uint16_t) == 2, uint16_t);
HAP_STATIC_ASSERT(sizeof (uint32_t) == 4, uint32_t);
HAP_STATIC_ASSERT(sizeof (uint64_t) == 8, uint64_t);
HAP_STATIC_ASSERT(sizeof (int8_t) == 1, int8_t);
HAP_STATIC_ASSERT(sizeof (int16_t) == 2, int16_t);
HAP_STATIC_ASSERT(sizeof (int32_t) == 4, int32_t);
HAP_STATIC_ASSERT(sizeof (int64_t) == 8, int64_t);
HAP_STATIC_ASSERT(sizeof (float) == sizeof (uint32_t), float);
HAP_STATIC_ASSERT(sizeof (double) == sizeof (uint64_t), double);
HAP_STATIC_ASSERT(sizeof (size_t) <= sizeof (uint64_t), size_t);

HAP_STATIC_ASSERT('\b' == 0x8, Backspace);
HAP_STATIC_ASSERT('\f' == 0xc, FormFeed);
HAP_STATIC_ASSERT('\n' == 0xa, NewLine);
HAP_STATIC_ASSERT('\r' == 0xd, CarriageReturn);
HAP_STATIC_ASSERT('\t' == 0x9, HorizontalTab);

/**
 * Reads a Uint8 value from a buffer.
 *
 * @param      bytes                Buffer to read from. Must contain at least 1 byte.
 *
 * @return Value that has been read.
 */
#define HAPReadUInt8(bytes) \
    (((const uint8_t *) (bytes))[0])

/**
 * Reads a UInt16 value from a buffer containing its corresponding little-endian representation.
 *
 * @param      bytes                Buffer to read from. Must contain at least 2 bytes.
 *
 * @return Value that has been read.
 */
#define HAPReadLittleUInt16(bytes) \
    (uint16_t) ( \
